import sys
input = sys.stdin.readline
n = int(input())

# 마지막 칸을 바라 보자, 
# 경우의 수는 (위에서 부터)
# A ,B 둘다 쓰니까  메모리 초과 남
# 같은거 니까
# A(n-1)
#  n-1
# ㅁㅁㅁㅁ
# ㅁㅁㅁ
#  n-2 

# B(n-1)
#  n-2 
# ㅁㅁㅁ
# ㅁㅁㅁㅁ
#  n-1

# A(1)
# ㅁ
# 

# A(2)
# ㅁㅁ
# ㅁ

# 점화식
#       (2,1), (1,1)+(1,1) , (1,2)+(1,2) , (1,1)+(1,2) ,(1,2)+(1,1)
# dp(n) = dp(n-1) + dp(n-1) + dp(n-2) + A(n-1) + B(n-1)


# A(n-1) = dp(n-2) + B(n-2)
# B(n-1) = dp(n-2) + A(n-2)
#
# 초기화
dp = [0]*(n+2)
A = [0]*(n+2)
B = [0]*(n+2)

dp[1] = 2
A[1] = 1
B[1] = 1

dp[2] = dp[1]*2 + 1 + A[1] +B[1]

if n > 2:
    # 초기화 (기본 값)/ 바텀업 방식
    for i in range(3,n+1):
        B[i-1] = dp[i-2] + A[i-2]
        A[i-1] = dp[i-2] +B[i-2]
        
        dp[i] = (dp[i-1]*2 +dp[i-2] + A[i-1] +B[i-1])%1000000007
    
    print(dp[n])

else:
    print(dp[n]%1000000007)